ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_adc.cpp
/**
  ******************************************************************************
  * @file    stm32f10x_adc.c
  * @author  MCD Application Team
  * @version V3.5.0
  * @date    11-March-2011
  * @brief   This file provides all the ADC firmware functions.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_rcc.h"
#include "stm32f10x_adc.h"
uint16_t ADC::ObjectNum[2] = {0,0};
/** @addtogroup STM32F10x_StdPeriph_Driver
  * @{
  */

/** @defgroup ADC
  * @brief ADC driver modules
  * @{
  */

/** @defgroup ADC_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup ADC_Private_Defines
  * @{
  */

/* ADC DISCNUM mask */
#define CR1_DISCNUM_Reset           ((uint32_t)0xFFFF1FFF)

/* ADC DISCEN mask */
#define CR1_DISCEN_Set              ((uint32_t)0x00000800)
#define CR1_DISCEN_Reset            ((uint32_t)0xFFFFF7FF)

/* ADC JAUTO mask */
#define CR1_JAUTO_Set               ((uint32_t)0x00000400)
#define CR1_JAUTO_Reset             ((uint32_t)0xFFFFFBFF)

/* ADC JDISCEN mask */
#define CR1_JDISCEN_Set             ((uint32_t)0x00001000)
#define CR1_JDISCEN_Reset           ((uint32_t)0xFFFFEFFF)

/* ADC AWDCH mask */
#define CR1_AWDCH_Reset             ((uint32_t)0xFFFFFFE0)

/* ADC Analog watchdog enable mode mask */
#define CR1_AWDMode_Reset           ((uint32_t)0xFF3FFDFF)

/* CR1 register Mask */
#define CR1_CLEAR_Mask              ((uint32_t)0xFFF0FEFF)

/* ADC ADON mask */
#define CR2_ADON_Set                ((uint32_t)0x00000001)
#define CR2_ADON_Reset              ((uint32_t)0xFFFFFFFE)

/* ADC DMA mask */
#define CR2_DMA_Set                 ((uint32_t)0x00000100)
#define CR2_DMA_Reset               ((uint32_t)0xFFFFFEFF)

/* ADC RSTCAL mask */
#define CR2_RSTCAL_Set              ((uint32_t)0x00000008)

/* ADC CAL mask */
#define CR2_CAL_Set                 ((uint32_t)0x00000004)

/* ADC SWSTART mask */
#define CR2_SWSTART_Set             ((uint32_t)0x00400000)

/* ADC EXTTRIG mask */
#define CR2_EXTTRIG_Set             ((uint32_t)0x00100000)
#define CR2_EXTTRIG_Reset           ((uint32_t)0xFFEFFFFF)

/* ADC Software start mask */
#define CR2_EXTTRIG_SWSTART_Set     ((uint32_t)0x00500000)
#define CR2_EXTTRIG_SWSTART_Reset   ((uint32_t)0xFFAFFFFF)

/* ADC JEXTSEL mask */
#define CR2_JEXTSEL_Reset           ((uint32_t)0xFFFF8FFF)

/* ADC JEXTTRIG mask */
#define CR2_JEXTTRIG_Set            ((uint32_t)0x00008000)
#define CR2_JEXTTRIG_Reset          ((uint32_t)0xFFFF7FFF)

/* ADC JSWSTART mask */
#define CR2_JSWSTART_Set            ((uint32_t)0x00200000)

/* ADC injected software start mask */
#define CR2_JEXTTRIG_JSWSTART_Set   ((uint32_t)0x00208000)
#define CR2_JEXTTRIG_JSWSTART_Reset ((uint32_t)0xFFDF7FFF)

/* ADC TSPD mask */
#define CR2_TSVREFE_Set             ((uint32_t)0x00800000)
#define CR2_TSVREFE_Reset           ((uint32_t)0xFF7FFFFF)

/* CR2 register Mask */
#define CR2_CLEAR_Mask              ((uint32_t)0xFFF1F7FD)

/* ADC SQx mask */
#define SQR3_SQ_Set                 ((uint32_t)0x0000001F)
#define SQR2_SQ_Set                 ((uint32_t)0x0000001F)
#define SQR1_SQ_Set                 ((uint32_t)0x0000001F)

/* SQR1 register Mask */
#define SQR1_CLEAR_Mask             ((uint32_t)0xFF0FFFFF)

/* ADC JSQx mask */
#define JSQR_JSQ_Set                ((uint32_t)0x0000001F)

/* ADC JL mask */
#define JSQR_JL_Set                 ((uint32_t)0x00300000)
#define JSQR_JL_Reset               ((uint32_t)0xFFCFFFFF)

/* ADC SMPx mask */
#define SMPR1_SMP_Set               ((uint32_t)0x00000007)
#define SMPR2_SMP_Set               ((uint32_t)0x00000007)

/* ADC JDRx registers offset */
#define JDR_Offset                  ((uint8_t)0x28)

/* ADC1 DR register base address */
#define DR_ADDRESS                  ((uint32_t)0x4001244C)

/**
  * @}
  */

/** @defgroup ADC_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup ADC_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup ADC_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup ADC_Private_Functions
  * @{
  */
void ADC::Increase()
{
	switch((uint32_t)ADCx)
	{
		case ADC1_BASE:
			ObjectNum[0]++;
			break;
		case ADC2_BASE:
			ObjectNum[1]++;
			break;
	}
}
uint16_t ADC::Decrease()
{
	switch((uint32_t)ADCx)
	{
		case ADC1_BASE:
			return --ObjectNum[0];
		case ADC2_BASE:
			return --ObjectNum[1];
	}
	return 0xFFFF;
}
ADC::ADC(ADC_TypeDef* _ADCx, InitTypeDef& ADC_InitStruct) : ADCx(_ADCx)
{
	this->Increase();
	this->Init(ADC_InitStruct);    //关联外设并且初始化和启动
	this->On();
	this->ResetCalibration();
	while(this->GetResetCalibrationStatus());
	this->StartCalibration();
	while(this->GetCalibrationStatus());
}
ADC::ADC(ADC_TypeDef* _ADCx, uint32_t Mode, FunctionalState ScanConvMode, FunctionalState ContinuousConvMode, uint32_t ExternalTrigConv, uint32_t DataAlign, uint8_t NbrOfChannel) :ADCx(_ADCx)
{
	this->Increase();
	ADC::InitTypeDef aaa;
	aaa.Mode = Mode;
	aaa.ScanConvMode = ScanConvMode;
	aaa.ContinuousConvMode = ContinuousConvMode;
	aaa.ExternalTrigConv = ExternalTrigConv;
	aaa.DataAlign = DataAlign;
	aaa.NbrOfChannel = NbrOfChannel;
	this->Init(aaa);
	this->On();
	this->ResetCalibration();
	while(this->GetResetCalibrationStatus());
	this->StartCalibration();
	while(this->GetCalibrationStatus());
}
ADC::ADC(const ADC& Other)
{
	this->ADCx = Other.ADCx;
	this->Increase();
}
ADC_TypeDef* ADC::GetPeriphPointer(void)
{
	return this->ADCx;
}
void ADC::On()
{
	this->Cmd(ENABLE);   //启动外设
}
void ADC::Off()
{
	this->Cmd(DISABLE);   //关闭外设
}
ADC& ADC::operator>>(uint16_t& Data)
{
	while(not this->GetFlagStatus(ADC_FLAG_EOC)); //等待上一次转换完成
	Data = this->ADCx->DR;    //读取DR寄存器,支持连续读取
	return *this;
}
ADC::~ADC()
{
	if(this->Decrease()==0)
	{
		this->Off();
		RCC::ClockCmd(*this,DISABLE);
	}
}
/**
  * @brief  Deinitializes the ADCx peripheral registers to their default reset values.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @retval None
  */
void ADC::DeInit(void)
{
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));

	if(ADCx == ADC1)
	{
		/* Enable ADC1 reset state */
		RCC::APB2PeriphResetCmd(RCC_APB2Periph_ADC1, ENABLE);
		/* Release ADC1 from reset state */
		RCC::APB2PeriphResetCmd(RCC_APB2Periph_ADC1, DISABLE);
	}
	else if(ADCx == ADC2)
	{
		/* Enable ADC2 reset state */
		RCC::APB2PeriphResetCmd(RCC_APB2Periph_ADC2, ENABLE);
		/* Release ADC2 from reset state */
		RCC::APB2PeriphResetCmd(RCC_APB2Periph_ADC2, DISABLE);
	}
	else
	{
		if(ADCx == ADC3)
		{
			/* Enable ADC3 reset state */
			RCC::APB2PeriphResetCmd(RCC_APB2Periph_ADC3, ENABLE);
			/* Release ADC3 from reset state */
			RCC::APB2PeriphResetCmd(RCC_APB2Periph_ADC3, DISABLE);
		}
	}
}

/**
  * @brief  Initializes the ADCx peripheral according to the specified parameters
  *         in the ADC_InitStruct.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_InitStruct: pointer to an ADC_InitTypeDef structure that contains
  *         the configuration information for the specified ADC peripheral.
  * @retval None
  */
void ADC::Init(InitTypeDef &ADC_InitStruct)
{
	uint32_t tmpreg1 = 0;
	uint8_t tmpreg2 = 0;
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	assert_param(IS_ADC_Mode(ADC_InitStruct.Mode));
	assert_param(IS_FUNCTIONAL_STATE(ADC_InitStruct.ScanConvMode));
	assert_param(IS_FUNCTIONAL_STATE(ADC_InitStruct.ContinuousConvMode));
	assert_param(IS_ADC_EXT_TRIG(ADC_InitStruct.ExternalTrigConv));
	assert_param(IS_ADC_DATA_ALIGN(ADC_InitStruct.DataAlign));
	assert_param(IS_ADC_REGULAR_LENGTH(ADC_InitStruct.NbrOfChannel));
	RCC::ClockCmd(*this,ENABLE);
	/*---------------------------- ADCx CR1 Configuration -----------------*/
	/* Get the ADCx CR1 value */
	tmpreg1 = ADCx->CR1;
	/* Clear DUALMOD and SCAN bits */
	tmpreg1 &= CR1_CLEAR_Mask;
	/* Configure ADCx: Dual mode and scan conversion mode */
	/* Set DUALMOD bits according to Mode value */
	/* Set SCAN bit according to ScanConvMode value */
	tmpreg1 |= (uint32_t)(ADC_InitStruct.Mode | ((uint32_t)ADC_InitStruct.ScanConvMode << 8));
	/* Write to ADCx CR1 */
	ADCx->CR1 = tmpreg1;

	/*---------------------------- ADCx CR2 Configuration -----------------*/
	/* Get the ADCx CR2 value */
	tmpreg1 = ADCx->CR2;
	/* Clear CONT, ALIGN and EXTSEL bits */
	tmpreg1 &= CR2_CLEAR_Mask;
	/* Configure ADCx: external trigger event and continuous conversion mode */
	/* Set ALIGN bit according to DataAlign value */
	/* Set EXTSEL bits according to ExternalTrigConv value */
	/* Set CONT bit according to ContinuousConvMode value */
	tmpreg1 |= (uint32_t)(ADC_InitStruct.DataAlign | ADC_InitStruct.ExternalTrigConv |
	                      ((uint32_t)ADC_InitStruct.ContinuousConvMode << 1));
	/* Write to ADCx CR2 */
	ADCx->CR2 = tmpreg1;

	/*---------------------------- ADCx SQR1 Configuration -----------------*/
	/* Get the ADCx SQR1 value */
	tmpreg1 = ADCx->SQR1;
	/* Clear L bits */
	tmpreg1 &= SQR1_CLEAR_Mask;
	/* Configure ADCx: regular channel sequence length */
	/* Set L bits according to NbrOfChannel value */
	tmpreg2 |= (uint8_t)(ADC_InitStruct.NbrOfChannel - (uint8_t)1);
	tmpreg1 |= (uint32_t)tmpreg2 << 20;
	/* Write to ADCx SQR1 */
	ADCx->SQR1 = tmpreg1;
}

/**
  * @brief  Fills each ADC_InitStruct member with its default value.
  * @param  ADC_InitStruct : pointer to an ADC_InitTypeDef structure which will be initialized.
  * @retval None
  */
void ADC::StructInit(InitTypeDef &ADC_InitStruct)
{
	/* Reset ADC init structure parameters values */
	/* Initialize the Mode member */
	ADC_InitStruct.Mode = ADC_Mode_Independent;
	/* initialize the ScanConvMode member */
	ADC_InitStruct.ScanConvMode = DISABLE;
	/* Initialize the ContinuousConvMode member */
	ADC_InitStruct.ContinuousConvMode = DISABLE;
	/* Initialize the ExternalTrigConv member */
	ADC_InitStruct.ExternalTrigConv = ADC_ExternalTrigConv_T1_CC1;
	/* Initialize the DataAlign member */
	ADC_InitStruct.DataAlign = ADC_DataAlign_Right;
	/* Initialize the NbrOfChannel member */
	ADC_InitStruct.NbrOfChannel = 1;
}

/**
  * @brief  Enables or disables the specified ADC peripheral.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  NewState: new state of the ADCx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC::Cmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Set the ADON bit to wake up the ADC from power down mode */
		ADCx->CR2 |= CR2_ADON_Set;
	}
	else
	{
		/* Disable the selected ADC peripheral */
		ADCx->CR2 &= CR2_ADON_Reset;
	}
}

/**
  * @brief  Enables or disables the specified ADC DMA request.
  * @param  ADCx: where x can be 1 or 3 to select the ADC peripheral.
  *   Note: ADC2 hasn't a DMA capability.
  * @param  NewState: new state of the selected ADC DMA transfer.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC::DMACmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_ADC_DMA_PERIPH(ADCx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Enable the selected ADC DMA request */
		ADCx->CR2 |= CR2_DMA_Set;
	}
	else
	{
		/* Disable the selected ADC DMA request */
		ADCx->CR2 &= CR2_DMA_Reset;
	}
}

/**
  * @brief  Enables or disables the specified ADC interrupts.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_IT: specifies the ADC interrupt sources to be enabled or disabled.
  *   This parameter can be any combination of the following values:
  *     @arg ADC_IT_EOC: End of conversion interrupt mask
  *     @arg ADC_IT_AWD: Analog watchdog interrupt mask
  *     @arg ADC_IT_JEOC: End of injected conversion interrupt mask
  * @param  NewState: new state of the specified ADC interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC::ITConfig(uint16_t ADC_IT, FunctionalState NewState)
{
	uint8_t itmask = 0;
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	assert_param(IS_ADC_IT(ADC_IT));
	/* Get the ADC IT index */
	itmask = (uint8_t)ADC_IT;
	if(NewState != DISABLE)
	{
		/* Enable the selected ADC interrupts */
		ADCx->CR1 |= itmask;
	}
	else
	{
		/* Disable the selected ADC interrupts */
		ADCx->CR1 &= (~(uint32_t)itmask);
	}
}

/**
  * @brief  Resets the selected ADC calibration registers.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @retval None
  */
void ADC::ResetCalibration(void)
{
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	/* Resets the selected ADC calibration registers */
	ADCx->CR2 |= CR2_RSTCAL_Set;
}

/**
  * @brief  Gets the selected ADC reset calibration registers status.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @retval The new state of ADC reset calibration registers (SET or RESET).
  */
FlagStatus ADC::GetResetCalibrationStatus(void)
{
	FlagStatus bitstatus = RESET;
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	/* Check the status of RSTCAL bit */
	if((ADCx->CR2 & CR2_RSTCAL_Set) != (uint32_t)RESET)
	{
		/* RSTCAL bit is set */
		bitstatus = SET;
	}
	else
	{
		/* RSTCAL bit is reset */
		bitstatus = RESET;
	}
	/* Return the RSTCAL bit status */
	return  bitstatus;
}

/**
  * @brief  Starts the selected ADC calibration process.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @retval None
  */
void ADC::StartCalibration(void)
{
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	/* Enable the selected ADC calibration process */
	ADCx->CR2 |= CR2_CAL_Set;
}

/**
  * @brief  Gets the selected ADC calibration status.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @retval The new state of ADC calibration (SET or RESET).
  */
FlagStatus ADC::GetCalibrationStatus(void)
{
	FlagStatus bitstatus = RESET;
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	/* Check the status of CAL bit */
	if((ADCx->CR2 & CR2_CAL_Set) != (uint32_t)RESET)
	{
		/* CAL bit is set: calibration on going */
		bitstatus = SET;
	}
	else
	{
		/* CAL bit is reset: end of calibration */
		bitstatus = RESET;
	}
	/* Return the CAL bit status */
	return  bitstatus;
}

/**
  * @brief  Enables or disables the selected ADC software start conversion .
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  NewState: new state of the selected ADC software start conversion.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC::SoftwareStartConvCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Enable the selected ADC conversion on external event and start the selected
		   ADC conversion */
		ADCx->CR2 |= CR2_EXTTRIG_SWSTART_Set;
	}
	else
	{
		/* Disable the selected ADC conversion on external event and stop the selected
		   ADC conversion */
		ADCx->CR2 &= CR2_EXTTRIG_SWSTART_Reset;
	}
}

/**
  * @brief  Gets the selected ADC Software start conversion Status.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @retval The new state of ADC software start conversion (SET or RESET).
  */
FlagStatus ADC::GetSoftwareStartConvStatus(void)
{
	FlagStatus bitstatus = RESET;
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	/* Check the status of SWSTART bit */
	if((ADCx->CR2 & CR2_SWSTART_Set) != (uint32_t)RESET)
	{
		/* SWSTART bit is set */
		bitstatus = SET;
	}
	else
	{
		/* SWSTART bit is reset */
		bitstatus = RESET;
	}
	/* Return the SWSTART bit status */
	return  bitstatus;
}

/**
  * @brief  Configures the discontinuous mode for the selected ADC regular
  *         group channel.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  Number: specifies the discontinuous mode regular channel
  *         count value. This number must be between 1 and 8.
  * @retval None
  */
void ADC::DiscModeChannelCountConfig(uint8_t Number)
{
	uint32_t tmpreg1 = 0;
	uint32_t tmpreg2 = 0;
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	assert_param(IS_ADC_REGULAR_DISC_NUMBER(Number));
	/* Get the old register value */
	tmpreg1 = ADCx->CR1;
	/* Clear the old discontinuous mode channel count */
	tmpreg1 &= CR1_DISCNUM_Reset;
	/* Set the discontinuous mode channel count */
	tmpreg2 = Number - 1;
	tmpreg1 |= tmpreg2 << 13;
	/* Store the new register value */
	ADCx->CR1 = tmpreg1;
}

/**
  * @brief  Enables or disables the discontinuous mode on regular group
  *         channel for the specified ADC
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  NewState: new state of the selected ADC discontinuous mode
  *         on regular group channel.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC::DiscModeCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Enable the selected ADC regular discontinuous mode */
		ADCx->CR1 |= CR1_DISCEN_Set;
	}
	else
	{
		/* Disable the selected ADC regular discontinuous mode */
		ADCx->CR1 &= CR1_DISCEN_Reset;
	}
}

/**
  * @brief  Configures for the selected ADC regular channel its corresponding
  *         rank in the sequencer and its sample time.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_Channel: the ADC channel to configure.
  *   This parameter can be one of the following values:
  *     @arg ADC_Channel_0: ADC Channel0 selected
  *     @arg ADC_Channel_1: ADC Channel1 selected
  *     @arg ADC_Channel_2: ADC Channel2 selected
  *     @arg ADC_Channel_3: ADC Channel3 selected
  *     @arg ADC_Channel_4: ADC Channel4 selected
  *     @arg ADC_Channel_5: ADC Channel5 selected
  *     @arg ADC_Channel_6: ADC Channel6 selected
  *     @arg ADC_Channel_7: ADC Channel7 selected
  *     @arg ADC_Channel_8: ADC Channel8 selected
  *     @arg ADC_Channel_9: ADC Channel9 selected
  *     @arg ADC_Channel_10: ADC Channel10 selected
  *     @arg ADC_Channel_11: ADC Channel11 selected
  *     @arg ADC_Channel_12: ADC Channel12 selected
  *     @arg ADC_Channel_13: ADC Channel13 selected
  *     @arg ADC_Channel_14: ADC Channel14 selected
  *     @arg ADC_Channel_15: ADC Channel15 selected
  *     @arg ADC_Channel_16: ADC Channel16 selected
  *     @arg ADC_Channel_17: ADC Channel17 selected
  * @param  Rank: The rank in the regular group sequencer. This parameter must be between 1 to 16.
  * @param  ADC_SampleTime: The sample time value to be set for the selected channel.
  *   This parameter can be one of the following values:
  *     @arg ADC_SampleTime_1Cycles5: Sample time equal to 1.5 cycles
  *     @arg ADC_SampleTime_7Cycles5: Sample time equal to 7.5 cycles
  *     @arg ADC_SampleTime_13Cycles5: Sample time equal to 13.5 cycles
  *     @arg ADC_SampleTime_28Cycles5: Sample time equal to 28.5 cycles
  *     @arg ADC_SampleTime_41Cycles5: Sample time equal to 41.5 cycles
  *     @arg ADC_SampleTime_55Cycles5: Sample time equal to 55.5 cycles
  *     @arg ADC_SampleTime_71Cycles5: Sample time equal to 71.5 cycles
  *     @arg ADC_SampleTime_239Cycles5: Sample time equal to 239.5 cycles
  * @retval None
  */
void ADC::RegularChannelConfig(uint8_t ADC_Channel, uint8_t Rank, uint8_t ADC_SampleTime)
{
	uint32_t tmpreg1 = 0, tmpreg2 = 0;
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	assert_param(IS_ADC_CHANNEL(ADC_Channel));
	assert_param(IS_ADC_REGULAR_RANK(Rank));
	assert_param(IS_ADC_SAMPLE_TIME(ADC_SampleTime));
	/* if ADC_Channel_10 ... ADC_Channel_17 is selected */
	if(ADC_Channel > ADC_Channel_9)
	{
		/* Get the old register value */
		tmpreg1 = ADCx->SMPR1;
		/* Calculate the mask to clear */
		tmpreg2 = SMPR1_SMP_Set << (3 * (ADC_Channel - 10));
		/* Clear the old channel sample time */
		tmpreg1 &= ~tmpreg2;
		/* Calculate the mask to set */
		tmpreg2 = (uint32_t)ADC_SampleTime << (3 * (ADC_Channel - 10));
		/* Set the new channel sample time */
		tmpreg1 |= tmpreg2;
		/* Store the new register value */
		ADCx->SMPR1 = tmpreg1;
	}
	else /* ADC_Channel include in ADC_Channel_[0..9] */
	{
		/* Get the old register value */
		tmpreg1 = ADCx->SMPR2;
		/* Calculate the mask to clear */
		tmpreg2 = SMPR2_SMP_Set << (3 * ADC_Channel);
		/* Clear the old channel sample time */
		tmpreg1 &= ~tmpreg2;
		/* Calculate the mask to set */
		tmpreg2 = (uint32_t)ADC_SampleTime << (3 * ADC_Channel);
		/* Set the new channel sample time */
		tmpreg1 |= tmpreg2;
		/* Store the new register value */
		ADCx->SMPR2 = tmpreg1;
	}
	/* For Rank 1 to 6 */
	if(Rank < 7)
	{
		/* Get the old register value */
		tmpreg1 = ADCx->SQR3;
		/* Calculate the mask to clear */
		tmpreg2 = SQR3_SQ_Set << (5 * (Rank - 1));
		/* Clear the old SQx bits for the selected rank */
		tmpreg1 &= ~tmpreg2;
		/* Calculate the mask to set */
		tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 1));
		/* Set the SQx bits for the selected rank */
		tmpreg1 |= tmpreg2;
		/* Store the new register value */
		ADCx->SQR3 = tmpreg1;
	}
	/* For Rank 7 to 12 */
	else if(Rank < 13)
	{
		/* Get the old register value */
		tmpreg1 = ADCx->SQR2;
		/* Calculate the mask to clear */
		tmpreg2 = SQR2_SQ_Set << (5 * (Rank - 7));
		/* Clear the old SQx bits for the selected rank */
		tmpreg1 &= ~tmpreg2;
		/* Calculate the mask to set */
		tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 7));
		/* Set the SQx bits for the selected rank */
		tmpreg1 |= tmpreg2;
		/* Store the new register value */
		ADCx->SQR2 = tmpreg1;
	}
	/* For Rank 13 to 16 */
	else
	{
		/* Get the old register value */
		tmpreg1 = ADCx->SQR1;
		/* Calculate the mask to clear */
		tmpreg2 = SQR1_SQ_Set << (5 * (Rank - 13));
		/* Clear the old SQx bits for the selected rank */
		tmpreg1 &= ~tmpreg2;
		/* Calculate the mask to set */
		tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 13));
		/* Set the SQx bits for the selected rank */
		tmpreg1 |= tmpreg2;
		/* Store the new register value */
		ADCx->SQR1 = tmpreg1;
	}
}

/**
  * @brief  Enables or disables the ADCx conversion through external trigger.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  NewState: new state of the selected ADC external trigger start of conversion.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC::ExternalTrigConvCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_ADC_ALL_PERIPH(ADCx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));
	if(NewState != DISABLE)
	{
		/* Enable the selected ADC conversion on external event */
		ADCx->CR2 |= CR2_EXTTRIG_Set;
	}
	else
	{
		/* Disable the selected ADC conversion on external event */
		ADCx->CR2 &= CR2_EXTTRIG_Reset;
	}
}

